haymanmk/stm32f7xx_grbl/Core/Src/step.c
#include <string.h>
#include "stm32f7xx_hal.h"
#include "stm32f7xx_timer_extension.h"
#include "FreeRTOS.h"
#include "task.h"
#include "grbl.h"

#undef X_AXIS
#undef Y_AXIS
#undef Z_AXIS
#undef N_AXIS

#include "stm32f7xx_grbl.h"

#define N_AXIS NUM_DIMENSIONS
#define PULSE_FREQ 100000  // Hz
#define HALF_PERIOD 0x7FFF // 0xFFFF / 2

/* extern variables */
extern TIM_HandleTypeDef htim2;
extern TIM_HandleTypeDef htim5;

/**
 * Type Defines
 */
typedef struct TIM_DMA_Parameters
{
    TIM_HandleTypeDef *htim;
    uint8_t TIM_DMA_ID;
    uint8_t TIM_DMA_ID_CC;
    uint8_t TIM_CHANNEL;
    HAL_TIM_ActiveChannel TIM_ACTIVE_CHANNEL;
    uint32_t CCRx_Addr;
    uint32_t CompareEventID;
    uint8_t Step_Bit;
    uint8_t Dir_Bit;
    uint32_t TIM_FLAG_CCx; // capture/compare interrupt flag
    volatile uint32_t *CCMRx_Addr;
    uint32_t OCxM_Mask;
    uint8_t OCxM_Shift;
    uint32_t TIM_DIER_CCxDE;
    DMA_HandleTypeDef *hdma;
    volatile uint32_t *DirOutputPort;
} TIM_DMA_Parameters_t;

static inline void stepSetOCMode(const TIM_DMA_Parameters_t *p, uint32_t mode)
{
    *p->CCMRx_Addr = (*p->CCMRx_Addr & ~p->OCxM_Mask) | (mode << p->OCxM_Shift);
}

static inline void stepClearPendingDmaRequest(const TIM_DMA_Parameters_t *p)
{
    TIM_TypeDef *t = p->htim->Instance;
    t->DIER &= ~p->TIM_DIER_CCxDE;
    t->DIER |=  p->TIM_DIER_CCxDE;
}

// tcie_bit must be either DMA_IT_TC (enable transfer-complete IRQ) or 0 (disable).
// We clear-then-OR to flip TCIE explicitly each cycle, since the dominant axis can change between slots.
static inline void stepResumeDmaStream(DMA_HandleTypeDef *hdma, uint32_t buffer_addr, uint16_t length, uint32_t tcie_bit)
{
    DMA_Base_Registers *regs = (DMA_Base_Registers *)hdma->StreamBaseAddress;
    regs->IFCR = 0x3FU << hdma->StreamIndex;
    hdma->Instance->M0AR = buffer_addr;
    hdma->Instance->NDTR = length;
    hdma->Instance->CR  = (hdma->Instance->CR & ~DMA_IT_TC) | tcie_bit | DMA_SxCR_EN;
}

typedef struct
{
    doubleBufferArray_t data;
    uint16_t length;
} pulse_t;

/*
 * Type defines copied from stepper.c
 */
typedef uint16_t IO_TYPE;

// Stores the planner block Bresenham algorithm execution data for the segments in the segment
// buffer. Normally, this buffer is partially in-use, but, for the worst case scenario, it will
// never exceed the number of accessible stepper buffer segments (SEGMENT_BUFFER_SIZE-1).
// NOTE: This data is copied from the prepped planner blocks so that the planner blocks may be
// discarded when entirely consumed and completed by the segment buffer. Also, AMASS alters this
// data for its own use.
typedef struct
{
    uint32_t steps[N_AXIS];
    uint32_t step_event_count;
    IO_TYPE direction_bits;
#ifdef ENABLE_DUAL_AXIS
    uint8_t direction_bits_dual;
#endif
#ifdef VARIABLE_SPINDLE
    uint8_t is_pwm_rate_adjusted; // Tracks motions that require constant laser power/rate
#endif
#ifdef STM32F7XX_ARCH
    uint8_t realtime_output_pin_status; // Tracks the realtime output pin status for the block,
                                        // control output pin and axial motion at the same time.
#endif
} st_block_t;

// Primary stepper segment ring buffer. Contains small, short line segments for the stepper
// algorithm to execute, which are "checked-out" incrementally from the first block in the
// planner buffer. Once "checked-out", the steps in the segments buffer cannot be modified by
// the planner, where the remaining planner block steps still can.
typedef struct
{
    uint16_t n_step;          // Number of step events to be executed for this segment
    uint32_t cycles_per_tick; // Step distance traveled per ISR tick, aka step rate.
    uint8_t st_block_index;   // Stepper block data index. Uses this information to execute this segment.
#ifdef ADAPTIVE_MULTI_AXIS_STEP_SMOOTHING
    uint8_t amass_level; // Indicates AMASS level for the ISR to execute this segment
#else
    uint8_t prescaler; // Without AMASS, a prescaler is required to adjust for slow timing.
#endif
#ifdef VARIABLE_SPINDLE
    uint8_t spindle_pwm;
#endif
} segment_t;

// Stepper ISR data struct. Contains the running data for the main stepper ISR.
typedef struct
{
    // Used by the bresenham line algorithm
    uint32_t counter_x, // Counter variables for the bresenham line tracer
        counter_y,
        counter_z;
#ifdef STEP_PULSE_DELAY
    uint8_t step_bits; // Stores out_bits output to complete the step pulse delay
#endif

    uint8_t execute_step;     // Flags step execution for each interrupt.
    uint32_t step_pulse_time; // Step pulse reset time after step rise
    IO_TYPE step_outbits;     // The next stepping-bits to be output
    IO_TYPE dir_outbits;
#ifdef ENABLE_DUAL_AXIS
    uint8_t step_outbits_dual;
    uint8_t dir_outbits_dual;
#endif
#ifdef ADAPTIVE_MULTI_AXIS_STEP_SMOOTHING
    uint32_t steps[N_AXIS];
#endif

    uint16_t step_count;      // Steps remaining in line segment motion
    uint8_t exec_block_index; // Tracks the current st_block index. Change indicates new block.
    st_block_t *exec_block;   // Pointer to the block data for the segment being executed
    segment_t *exec_segment;  // Pointer to the segment being executed
} stepper_t;

typedef struct
{
    pulse_t pulse_data[NUM_DIMENSIONS];
    uint8_t motion_control_state;
    IO_TYPE dir_outbits;
    uint8_t realtime_output_pin_status;
    uint8_t tc_axis;             // axis whose DMA TC IRQ we'll watch (latest last-counter); UINT8_MAX = none
    uint32_t tc_last_counter;    // OFF-edge counter of tc_axis's last pulse in this slot
} pulse_block_t;

/**
 * Declare Variables
 */
// Ring buffer for each axis
static pulse_block_t pulseRingBuffer[RING_BUFFER_SIZE] = {0};

// ring buffer head and tail for each axis
volatile uint16_t pulseRingBufferHead = 0;
volatile uint16_t pulseRingBufferTail = 0;

// declare an array of timer and DMA parameters for each axis
static TIM_DMA_Parameters_t axisTimerDMAParams[NUM_DIMENSIONS];

// declare an array of general notification
volatile uint32_t generalNotification = (GENERAL_NOTIFICATION_GET_NEW_BUFFER | GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES | GENERAL_NOTIFICATION_FIRST_TIME_START);

// current steppers state, which can be used to determine if a stepper shall be re-enabled from idle.
volatile uint8_t currentStepperState = 0; // bit 0: x axis active, bit 1: y axis active, bit 2: z axis active

// current counter value only for calculating the pulse data
volatile uint32_t currentCounterValue = MINIMUN_LOW_PULSE_WIDTH_TICKS;

volatile uint32_t pulseBlockAddress = 0;

volatile uint8_t stepBlockedAxes = 0; // used during homing cycle

volatile uint8_t OC_DMA_Started = 0; // flag to check if OC DMA is started, bit 0: x axis, bit 1: y axis, bit 2: z axis

// handle for step task
TaskHandle_t xHandleStepTask = NULL;

/**
 * Function Prototypes
 */
void stepTask(void *pvParameters);
void stepUpdateDMABuffer(uint32_t address);
static void TIM_DMADelayPulseCplt(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef stepTimeOCStartDMA(TIM_HandleTypeDef *htim, uint32_t Channel, const uint32_t *pData, uint16_t Length);
uint16_t stepRingBufferGetNext();
uint16_t stepRingBufferIncrementHead();
uint16_t stepRingBufferGetTail();
void stepRingBufferIncrementTail();
uint32_t stepGetFreeDataAddress();
uint32_t stepGetAvailableDataAddress();

/* ============================= */
/* === Function Declarations === */
/* ============================= */
// initialization of step function
void stepInit(void)
{
    // disable irq
    __disable_irq();

    // stop master timer
    TIM_STOP_COUNTER(MASTER_TIM_HANDLE); // timer x axis

    // initialize axis parameters (populate precomputed CCMRx pointers, masks, shifts)
    INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, X_AXIS);
    INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, Y_AXIS);
    INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, Z_AXIS);

    // force output compare mode to inactive
    stepSetOCMode(&axisTimerDMAParams[X_AXIS], TIM_OCMODE_FORCED_INACTIVE);
    stepSetOCMode(&axisTimerDMAParams[Y_AXIS], TIM_OCMODE_FORCED_INACTIVE);
    stepSetOCMode(&axisTimerDMAParams[Z_AXIS], TIM_OCMODE_FORCED_INACTIVE);

