haymanmk/stm32f7xx_grbl/Core/Src/step.c
                    // start timer output mode with DMA stream
                    stepTimeOCStartDMA(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL, (uint32_t *)pulseData, pulseData->length);

                    // HAL_DMA_Start_IT enabled TC for all streams; clear it on non-dominant axes so only tc_axis fires
                    if (i != pulseBlock->tc_axis)
                    {
                        timDMAParamsPulse->hdma->Instance->CR &= ~DMA_IT_TC;
                    }

                    // generate compare event
                    HAL_TIM_GenerateEvent(timDMAParamsPulse->htim, timDMAParamsPulse->CompareEventID);

                    // set OC DMA started flag
                    OC_DMA_Started |= (1 << i);
                }
                else // this axis is not active
                {
                    // force output pin to low in output compare mode
                    stepSetOCMode(timDMAParamsPulse, TIM_OCMODE_INACTIVE);
                }

                // check if it is the master timer
                if (timDMAParamsPulse->htim != &MASTER_TIM_HANDLE)
                {
                    // enable the timer
                    __HAL_TIM_ENABLE(timDMAParamsPulse->htim);
                }
            }

            // set realtime output pin status
            UTILS_WRITE_GPIO(REALTIME_OUTPUT_GPIO_GROUP, REALTIME_OUTPUT_PIN, (pulseBlock->realtime_output_pin_status ^ 0x01));

            // update current motion control state by the motion_control_state coming with the pulse data
            currentStepperState = pulseBlock->motion_control_state;

            // set all DMA updated flag
            generalNotification |= GENERAL_NOTIFICATION_ALL_AXES_DMA_UPDATED;

            // enable the master timer
            __HAL_TIM_ENABLE(&MASTER_TIM_HANDLE);

            // clear the flag
            generalNotification &= ~GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES;
            generalNotification &= ~GENERAL_NOTIFICATION_FIRST_TIME_START;
        }
        // NOT the "First Time" to start the process, but out of data asking from the timer interrupt
        else
        {
            // get newly-available buffer
            pulseBlockAddress = stepGetAvailableDataAddress();

            if (pulseBlockAddress == 0)
            {
                continue;
            }

            stepUpdateDMABuffer(pulseBlockAddress);

            // master timer was never stopped in the new design; stepUpdateDMABuffer's
            // overshoot guard handles CNT alignment with the new buffer.
            generalNotification &= ~GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES;
        }
    }
}

HAL_StatusTypeDef stepCalculatePulseData(uint32_t st_addr)
{
    // set DEBUG_1_Pin to high ===> signal the start of pulse calculation
    // UTILS_WRITE_GPIO(DEBUG_1_GPIO_Port, DEBUG_1_Pin, 1);

    static uint8_t getNewBuffer = (1 << NUM_DIMENSIONS) - 1; // bit 0: x axis, bit 1: y axis, bit 2: z axis
    static pulse_block_t *pulseBlock = {0};
    static pulse_t *pulse;
    static IO_TYPE dirOutputBits = 0;
    static uint32_t cycles_per_tick = 0;
    // static uint8_t amass_level = 0;

    stepper_t *st = (stepper_t *)st_addr;

    if (st->exec_segment)
    {
        // update variables
        cycles_per_tick = st->exec_segment->cycles_per_tick;
        // amass_level = st->exec_segment->amass_level;

        if ((st->exec_segment->cycles_per_tick == 0) || (st->exec_segment->cycles_per_tick == 0xffffffff))
        {
            // debug message
            vLoggingPrintf("errParam\n");

            return HAL_ERROR;
        }
    }

    if (!(st->step_pulse_time))
    {
        // debug message
        vLoggingPrintf("errZero\n");

        return HAL_ERROR;
    }

    // determine if a new buffer is needed
    if (getNewBuffer || (dirOutputBits != st->dir_outbits) || (generalNotification & GENERAL_NOTIFICATION_GET_NEW_BUFFER))
    {
        // check if current buffer is not empty
        pulseBlock = &(pulseRingBuffer[pulseRingBufferHead]);

        if (pulseBlock->motion_control_state)
        {
            // increment head
            if (stepRingBufferIncrementHead() == UINT16_MAX)
            {
                // No more buffer available to store pulse data
                return HAL_BUSY;
            }
            // ring buffer head has been incremented

            // get the new buffer
            pulseBlock = &(pulseRingBuffer[pulseRingBufferHead]);
        }

        // reset motion control state
        pulseBlock->motion_control_state = 0;

        // reset TC-axis selection for the new slot
        pulseBlock->tc_axis = UINT8_MAX;

        // set direction state
        pulseBlock->dir_outbits = st->dir_outbits;

        // update direction output bits
        dirOutputBits = st->dir_outbits;

        // loop through all axes
        for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
        {
            // get pulse data
            pulse = &(pulseBlock->pulse_data[i]);

            // clear pulse length
            pulse->length = 0;
        }

        // clear the flag
        generalNotification &= ~GENERAL_NOTIFICATION_GET_NEW_BUFFER;
        getNewBuffer = 0;
    }

    // loop through all axes
    for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
    {
        // get timer and DMA parameters of this axis
        TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i];
        uint8_t step_bit = timDMAParamsPulse->Step_Bit;

        // get pulse data
        pulse = &(pulseBlock->pulse_data[i]);

        // determine if a pair of pulse data should be added in this axis or not by Bresenham line algorithm.
        // a pair of pulse data consists of a pulse data for the on state and a pulse data for the off state.
        uint16_t buf_length = pulse->length;

        if (st->step_outbits & (1 << step_bit))
        {
            uint32_t off_edge_counter = currentCounterValue + st->step_pulse_time;

            // set this axis to ACTIVE state
            pulseBlock->motion_control_state |= (1 << i);

            // add pulse data
            pulse->data[buf_length++] = currentCounterValue;   // ON edge
            pulse->data[buf_length++] = off_edge_counter;      // OFF edge

            // update the length of available data
            pulse->length = buf_length;

            // pick this axis as tc_axis if its last counter is later than the current best.
            // Signed-diff compare handles 32-bit wraparound; sentinel UINT8_MAX is "no candidate yet".
            if (pulseBlock->tc_axis == UINT8_MAX ||
                (int32_t)(off_edge_counter - pulseBlock->tc_last_counter) > 0)
            {
                pulseBlock->tc_axis = i;
                pulseBlock->tc_last_counter = off_edge_counter;
            }

            // check if the buffer is full
            if (buf_length >= DOUBLE_BUFFER_SIZE)
            {
                // set the flag to get new buffer
                getNewBuffer |= (1 << i);
            }
        }
    }

    // if there are any movements, update the motion control state reference by other associates.
    if (st->step_outbits)
    {
        // set realtime output pin status
        pulseBlock->realtime_output_pin_status = st->exec_block->realtime_output_pin_status;
    }

    // update variables
    currentCounterValue += cycles_per_tick; // * (amass_level + 1);

    return HAL_OK;
}

void stepUpdateDMABuffer(uint32_t address)
{
    pulse_block_t *pulseBlock = (pulse_block_t *)address;
    uint8_t upcomingAxesActiveState = pulseBlock->motion_control_state & (~stepBlockedAxes); // get upcoming axes active state
    // check if there is any bit that is set to 0 in currentStepperState
    // and the corresponding bit is set to 1 in upcomingAxesActiveState.
    // make these axes which shall be re-enabled from idle
    // uint8_t axisToBeReEnabled = (currentStepperState ^ upcomingAxesActiveState) & upcomingAxesActiveState;
    // uint8_t axisToContinue = currentStepperState & upcomingAxesActiveState;

    /**
     * Check if there is any axis that shall be re-enabled from idle, resume DMA stream, or turn into idle state
     */
    // manual update those axes that shall be re-enabled from idle and will stay in idle state in the upcoming cycle
    // to avoid update the same axis twice,
    // loop through all axes
    UTILS_WRITE_GPIO(DEBUG_2_GPIO_Port, DEBUG_2_Pin, 1);
    for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
    {
        // pulse data
        pulse_t *pulse = &(pulseBlock->pulse_data[i]);
        uint8_t dirOutputBit = axisTimerDMAParams[i].Dir_Bit;
        volatile uint32_t *pDirOutputPort = axisTimerDMAParams[i].DirOutputPort;

        // check if there is any axis shall be re-enabled from idle or resume DMA stream to continue on transferring data
        if (upcomingAxesActiveState & (1 << i))
        {

