haymanmk/stm32f7xx_grbl/Core/Src/step.c
            // set the axis to active
            currentStepperState |= (1 << i);

            // set the direction output bit according to the dir_outbit
            *pDirOutputPort = (*pDirOutputPort & ~(1 << dirOutputBit)) | (pulseBlock->dir_outbits & (1 << dirOutputBit));

            // force output turned into toggle mode
            stepSetOCMode(&axisTimerDMAParams[i], TIM_OCMODE_TOGGLE);

            // clear the pending DMA request in timer
            // stepClearPendingDmaRequest(&axisTimerDMAParams[i]);

            // only the tc_axis gets TC IRQ enabled; the rest run silently and auto-disable on NDTR=0
            uint32_t tcie_bit = (i == pulseBlock->tc_axis) ? DMA_IT_TC : 0U;

            // resume DMA stream with updated buffer and length
            if (OC_DMA_Started & (1 << i)) // OC DMA might be already started
            {
                stepResumeDmaStream(axisTimerDMAParams[i].hdma, (uint32_t)pulse, pulse->length, tcie_bit);
            }
            else // OC DMA is not started yet
            {
                stepTimeOCStartDMA(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_CHANNEL, (uint32_t *)pulse, pulse->length);

                // HAL_DMA_Start_IT enabled TC; clear it again if this isn't the tc_axis
                if (tcie_bit == 0U)
                {
                    axisTimerDMAParams[i].hdma->Instance->CR &= ~DMA_IT_TC;
                }

                // set OC DMA started flag
                OC_DMA_Started |= (1 << i);
            }
            // generate compare event to trigger the DMA transfer
            // GENERATE_TIM_EVENT(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].CompareEventID);
        }
        else // idle mode(present) -> idle mode(upcoming) or active mode(present) -> idle mode(upcoming)
        {
            // Force this axis's OC output LOW. Without this, an axis left in TOGGLE mode from a
            // previous motion (with a stale CCR holding its old last value) would spuriously
            // toggle the next time CNT catches up to that old CCR.
            stepSetOCMode(&axisTimerDMAParams[i], TIM_OCMODE_FORCED_INACTIVE);

            // set the axis to idle
            currentStepperState &= ~(1 << i);
        }
    }
    UTILS_WRITE_GPIO(DEBUG_2_GPIO_Port, DEBUG_2_Pin, 0);

    // set real-time output pin status
    UTILS_WRITE_GPIO(REALTIME_OUTPUT_GPIO_GROUP, REALTIME_OUTPUT_PIN, (pulseBlock->realtime_output_pin_status ^ 0x01));

    // Overshoot guard: master timer kept running through the load, so CNT may have passed
    // some axes' first ON targets. For each active axis, signed-diff compare data[0] vs CNT;
    // if any axis's first target was passed, rewind both timers' CNT to just before the
    // earliest-passed target so the missed match fires on the next tick.
    if (upcomingAxesActiveState)
    {
        UTILS_WRITE_GPIO(DEBUG_4_GPIO_Port, DEBUG_4_Pin, 1);
        uint32_t cnt = MASTER_TIM_HANDLE.Instance->CNT;
        int32_t earliest_delta = 0;
        uint32_t earliest_target = 0;
        uint8_t any_past = 0;

        for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
        {
            if (!(upcomingAxesActiveState & (1 << i))) continue;
            uint32_t target = pulseBlock->pulse_data[i].data[0];
            int32_t delta = (int32_t)(target - cnt);
            if (delta <= 0 && (!any_past || delta < earliest_delta))
            {
                earliest_delta = delta;
                earliest_target = target;
                any_past = 1;
            }
        }

        if (any_past)
        {
            uint32_t new_cnt = earliest_target - 1U;  // next tick matches earliest_target
            MASTER_TIM_HANDLE.Instance->CNT = new_cnt;
            Z_AXIS_TIM_HANDLE.Instance->CNT = new_cnt;  // keep slave-gated TIM5 aligned
        }

        // Ensure the master timer is running. In the hot ISR path this is a no-op (CEN already 1).
        // After stepGoIdle stopped the timer for motion-end, this is what restarts it for the next motion.
        TIM_START_COUNTER(MASTER_TIM_HANDLE);
        UTILS_WRITE_GPIO(DEBUG_4_GPIO_Port, DEBUG_4_Pin, 0);
    }
}

/**
 * @brief In case currentCounterValue is far behind the current counter value of the master timer,
 *        update the currentCounterValue to a value of the current counter value of the master timer
 *        plus a minimum low pulse width. This function is called after system turns into idle from feed hold.
 *        Due to the feed hold request, the currentCounterValue might be far behind the current counter value.
 *        The step data is calculated in advance and pushed in a ring buffer
 *        before it is transferred to the DMA buffer and wait for DMA to consume it, so the currentCounterValue
 *        is far behind the current counter value of the master timer. When user requests for feed hold,
 *        currentCounterValue is still far behind the current counter value. If user did not update this value,
 *        the next step data will be calculated upon this value, and timer will take a long time to reach there.
 *        The whole system will be delayed. To avoid this, this function shall be called to update the currentCounterValue
 *        after the feed hold request is committed.
 */
void stepUpdateCounterValue()
{
    // get counter value from the master timer and update the current counter value
    currentCounterValue =
        __HAL_TIM_GET_COUNTER(&MASTER_TIM_HANDLE) + MINIMUN_LOW_PULSE_WIDTH_TICKS;
}

/* =========================================================== */
/*                   DMA Transfer Complete ISR                 */
/* =========================================================== */
/**
 * @brief  TIM DMA Pulse complete callback.
 */
void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim)
{
    // set PD6 to high ===> signal the start of ISR
    UTILS_WRITE_GPIO(DEBUG_3_GPIO_Port, DEBUG_3_Pin, GPIO_PIN_SET);

    // avoid doing anything if the step agent has been reset from software.
    if (generalNotification & GENERAL_NOTIFICATION_FIRST_TIME_START)
    {
        goto exit;
    }

    // Master timer keeps running through the ISR — the last OFF edge fires naturally between TC
    // and end of this handler, so no pulse elongation. stepUpdateDMABuffer's overshoot guard
    // rewinds CNT if the new buffer's first target was passed during the load.
    pulseBlockAddress = stepGetAvailableDataAddress();

    if (pulseBlockAddress != 0)
    {
        stepUpdateDMABuffer(pulseBlockAddress);
    }
    else
    {
        // notify main task to update pulse data
        axis_t axis = GET_AXIS_FROM_TIM_HANDLE(htim);
        generalNotification |= GET_DATA_NOT_AVAILABLE_BIT(axis);
    }

