haymanmk/stm32f7xx_grbl/Core/Src/step.c
exit:
    // set PD6 to low ===> signal the end of ISR
    UTILS_WRITE_GPIO(DEBUG_3_GPIO_Port, DEBUG_3_Pin, GPIO_PIN_RESET);
}

/* =========================================================== */
/*       Assistant Functions for Ring buffer management        */
/* =========================================================== */
/**
 * Ring Buffer Manipulation Functions
 */
uint16_t stepRingBufferGetNext()
{
    /**
     * In order to avoid the data updating overwriting the data used by DMA,
     * the head and tail pointers are separated by a gap of N buffers.
     * N is defined by GAP_HEAD_TAIL. Howerver, instead of tracking the gap
     * to determine if there is a next free index, here we simply check if
     * the length of the populated data of ring buffer is less than
     * RING_BUFFER_SIZE - GAP_HEAD_TAIL.
     *
     * i.e.
     * | * | * | * | (Head)>> | 0 | 0 | >>(Tail) | * | * | * |
     * >-------- Body ------->|  GAP  |>------- Body -------->
     */
    uint16_t bodyLength = (pulseRingBufferHead - pulseRingBufferTail + RING_BUFFER_SIZE) % RING_BUFFER_SIZE;

    if (bodyLength < RING_BUFFER_SIZE - GAP_HEAD_TAIL)
    {
        return (pulseRingBufferHead + 1) % RING_BUFFER_SIZE;
    }
    else
        return UINT16_MAX;
}

uint16_t stepRingBufferIncrementHead()
{
    uint16_t nextIndex = stepRingBufferGetNext();

    if (nextIndex != UINT16_MAX)
    {
        pulseRingBufferHead = nextIndex;
    }

    return nextIndex;
}

uint16_t stepRingBufferGetTail()
{
    if (pulseRingBufferTail != pulseRingBufferHead)
    {
        return pulseRingBufferTail;
    }
    else
        return UINT16_MAX;
}

void stepRingBufferIncrementTail()
{
    if (pulseRingBufferTail != pulseRingBufferHead)
    {
        pulseRingBufferTail = (pulseRingBufferTail + 1) % (RING_BUFFER_SIZE);
    }
}

/**
 * Get the free data address
 * @param axis Axis to get the free data address
 * @return Free data address; 0 if no data available
 */
uint32_t stepGetFreeDataAddress()
{
    if (stepRingBufferGetNext() == UINT16_MAX)
        return 0;

    return (uint32_t)(&pulseRingBuffer[pulseRingBufferHead]);
}

/**
 * Get the available data address
 * @param axis Axis to get the available data address
 * @return Available data address; 0 if no data available
 */
uint32_t stepGetAvailableDataAddress()
{
    uint16_t tail = stepRingBufferGetTail();

    if (tail == UINT16_MAX)
        return 0;

    stepRingBufferIncrementTail();

    return (uint32_t)(&pulseRingBuffer[tail]);
}

/* ===================================================================== */
/*                      Everything about Stepper                         */
/* ===================================================================== */

// TODO(post-idle-restart-delay): On the third motion (or any post-idle motion whose active axis
// differs from the previous one), the first pulse does not fire immediately when the timer
// restarts. Hooking stepUpdateCounterValue() into the FORCE_STOP transition below was not enough.
// Things to check next session:
//   1. Confirm stepWakeUp is actually invoked by grbl on every motion-resume (instrument entry).
//   2. Trace currentCounterValue across stepGoIdle → stepWakeUp → first stepCalculatePulseData
//      call, and compare against MASTER_TIM CNT after the restart in stepUpdateDMABuffer.
//   3. Verify pulse_data[0] of the first slot of the new motion vs the snapshot of CNT taken by
//      the overshoot guard — the guard logs nothing today, may need a debug pin around it.
//   4. Possibility: stepCalculatePulseData runs and overwrites currentCounterValue before
//      stepWakeUp ever fires, so the realign is too late. If so, move the realign into the
//      stepTask "data not available -> data available" transition (around step.c:443 in the
//      NOT-First-Time recovery branch), guarded by the same FORCE_STOP-cleared signal.
void stepWakeUp()
{
    // check if pulse calculation is disabled
    if (generalNotification & GENERAL_NOTIFICATION_FORCE_STOP)
    {
        // Coming out of idle: hardware CNT is frozen wherever stepGoIdle stopped it, but the
        // software pulse-train cursor (currentCounterValue) kept advancing per-iteration during
        // the previous motion. Realign the cursor to CNT so the next motion's data[0] sits just
        // a few ticks ahead of CNT.
        stepUpdateCounterValue();

        // clear Force stop flag
        generalNotification &= ~GENERAL_NOTIFICATION_FORCE_STOP;
    }

    // start pulse calculation
    // stepEnablePulseCalculate();
}

void stepGoIdle()
{
    // Force all axes' OC outputs LOW before stopping the timer. In the new always-running design,
    // the counter could be mid-pulse (between an ON-edge match and the OFF-edge match), so stopping
    // it alone would freeze the output HIGH and invert the next motion's first toggle.
    stepSetOCMode(&axisTimerDMAParams[X_AXIS], TIM_OCMODE_FORCED_INACTIVE);
    stepSetOCMode(&axisTimerDMAParams[Y_AXIS], TIM_OCMODE_FORCED_INACTIVE);
    stepSetOCMode(&axisTimerDMAParams[Z_AXIS], TIM_OCMODE_FORCED_INACTIVE);

    // stop counter
    TIM_STOP_COUNTER(MASTER_TIM_HANDLE); // timer x axis

    // set Force stop flag
    generalNotification |= GENERAL_NOTIFICATION_FORCE_STOP;

    // stop pulse calculation
    // stepDisablePulseCalculate();
}

/**
 * @brief  Enable pulse calculation
 */
void stepEnablePulseCalculate()
{
    // set general notification
    generalNotification |= GENERAL_NOTIFICATION_CALCULATE_PULSE;

    stepNotifyContinuePulseCalculation();
}

/**
 * @brief  Disable pulse calculation
 */
void stepDisablePulseCalculate()
{
    // clear general notification
    generalNotification &= ~GENERAL_NOTIFICATION_CALCULATE_PULSE;
}

void stepNotifyContinuePulseCalculation()
{
    xTaskNotifyGive(xHandleStepTask);
}

void stepBlockAxis(uint8_t axis)
{
    // get timer and DMA parameters of this axis
    TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[axis];

    // set the axis to idle
    stepBlockedAxes |= (1 << axis);

    // force output pin to low in output compare mode
    stepSetOCMode(timDMAParamsPulse, TIM_OCMODE_FORCED_INACTIVE);
}

uint8_t stepIsPulseDataExhausted()
{
    return ((generalNotification & GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES) > 0);
    // return (pulseRingBufferHead == pulseRingBufferTail);
}

/* ===================================================================== */
/*                      Everything about Timer                           */
/* ===================================================================== */

/**
 * @brief  Starts the TIM Output Compare signal generation in DMA mode.
 * @param  htim TIM Output Compare handle
 * @param  Channel TIM Channel to be enabled
 *          This parameter can be one of the following values:
 *            @arg TIM_CHANNEL_1: TIM Channel 1 selected
 *            @arg TIM_CHANNEL_2: TIM Channel 2 selected
 *            @arg TIM_CHANNEL_3: TIM Channel 3 selected
 *            @arg TIM_CHANNEL_4: TIM Channel 4 selected
 * @param  pData The source Buffer address.
 * @param  Length The length of data to be transferred from memory to TIM peripheral
 * @retval HAL status
 */
HAL_StatusTypeDef stepTimeOCStartDMA(TIM_HandleTypeDef *htim, uint32_t Channel, const uint32_t *pData,
                                     uint16_t Length)
{
    HAL_StatusTypeDef status = HAL_OK;
    //   uint32_t tmpsmcr;

    /* Check the parameters */
    assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, Channel));

    /* Set the TIM channel state */
    if (TIM_CHANNEL_STATE_GET(htim, Channel) == HAL_TIM_CHANNEL_STATE_BUSY)
    {
        return HAL_BUSY;
    }
    else if (TIM_CHANNEL_STATE_GET(htim, Channel) == HAL_TIM_CHANNEL_STATE_READY)
    {
        if ((pData == NULL) || (Length == 0U))
        {
            return HAL_ERROR;
        }
        else
        {
            TIM_CHANNEL_STATE_SET(htim, Channel, HAL_TIM_CHANNEL_STATE_BUSY);
        }
    }
    else
    {
        return HAL_ERROR;
    }

    switch (Channel)
    {
    case TIM_CHANNEL_1:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC1]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC1]->XferErrorCallback = TIM_DMAError;

        /* Enable the DMA stream */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC1], (uint32_t)pData, (uint32_t)&htim->Instance->CCR1,
                             Length) != HAL_OK)
        {
            /* Return error status */
            return HAL_ERROR;
        }

        /* Enable the TIM Capture/Compare 1 DMA request */
        __HAL_TIM_ENABLE_DMA(htim, TIM_DMA_CC1);
        break;
    }

    case TIM_CHANNEL_2:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC2]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC2]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC2]->XferErrorCallback = TIM_DMAError;

        /* Enable the DMA stream */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC2], (uint32_t)pData, (uint32_t)&htim->Instance->CCR2,
                             Length) != HAL_OK)
        {
            /* Return error status */
            return HAL_ERROR;
        }

